// Date object
// ეს ობიექტი გამოიყენება რეალურ დროზე სამუშაოდ და მის შესახებ დიდი ინფორმაციის გასაგებად

// ჩვენ შეგვიძლია პირდაპირ გამოვიძახოთ Date ობიექტი და დაგვიბრუნდება ინფორმაცია ახლანდელი დროის შესახებ
console.log(Date())
// Thu Dec 18 2025 19:55:32 GMT+0400 (Georgia Standard Time)
// ეს ინფორმაცია დაგვიბრუნდა სთრინგის სახით

// ასევე, შეგვიძლია შევქმნათ სპეციალური ობიექტი Date ობიექტიდან და მასზე გამოვიძახოთ სასურველი მეთოდი.
const currentTime = new Date;
console.log(currentTime) // 2025-12-18T15:58:42.725Z (ეს არის ობიექტი)


// getFullYear
// ეს მეთოდი აბრუნებს მოცემული თარიღის წელს
console.log(currentTime.getFullYear());

// getMonth
// ეს მეთოდი აბრუნებს მოცემული თარიღის თვეს რიცხვის სახით
// მეთოდი თვეების ათვლას იწყებს იანვრიდან, რომელსაც ჩათვლის მენულე თვედ
// იანვარი - 0, თებერვალი - 1, მარტი - 2, აპრილი - 3, ..., დეკემბერი - 11
console.log(currentTime.getMonth())

const months = ["იანვარი", "თებერვალი", "მარტი", "აპრილი", "მაისი", "ივნისი", "ივლისი", "აგვისტო", "სექტემბერი", "ოქტომბერი", "ნოემბერი", "დეკემბერი"]
console.log(months[currentTime.getMonth()])


// getDate
// ეს მეთოდი აბრუნებს მოცემული თვის დღეს
// დაბრუნებული რიცხვი: 0-31
console.log(currentTime.getDate())


// getHours
// ეს მეთოდი აბრუნებს მოცემული თარიღის საათს
// დაბრუნებული რიცხვი: 0-23
console.log(currentTime.getHours())


// getMinutes
// ეს მეთოდი აბრუნებს მოცემული თარიღის წუთებს
// დაბრუნებული რიცხვი: 0-59
console.log(currentTime.getMinutes())


// getSeconds
// ეს მეთოდი აბრუნებს მოცემული თარიღის წამებს
// დაბრუნებული რიცხვი: 0-59
console.log(currentTime.getSeconds())


// getDay
// ეს მეთოდი აბრუნებს მოცემულ თარიღში კვირის მერამდენე დღეა
// დაბრუნებული რიცხვი: 0-6
// კვირა - 0, ორშაბათი - 1, სამშაბათი - 2, ..., შაბათი - 6
console.log(currentTime.getDay())

const days = ["კვირა", "ორშაბათი", "სამშაბათი", "ოთხშაბათი", "ხუთშაბათი", "პარასკევი", "შაბათი"]
console.log(days[currentTime.getDay()])